# LeaderEnd Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabelOptions..::..LeaderEnd Property
AlignmentStationLabelOptions Class See Also
---
Specifies the leader end point, in model coordinates. The default value is null. When null, the end point will be the same as the Origin point, driven by the Station value.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public XYZ LeaderEnd { get; set; }
```

Visual Basic
---
```text
Public Property LeaderEnd As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ LeaderEnd {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# See Also
AlignmentStationLabelOptions Class
Autodesk.Revit.DB.Infrastructure Namespace